app/views/entries/_footer.html.erb

SELECT COUNT(*) FROM "votes" WHERE "votes"."entry_id" = ?  [["entry_id", 20]]
---
  <li>
    <% if (count = entry.votes.count) > 0 %>