app/controllers/accounts_controller.rb

  def update
    @member = current_member
    @member.assign_attributes(account_params)
    if @member.save
---
UPDATE "members" SET "name" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["name", "Jiroa"], ["updated_at", "2020-05-12 10:17:55.211822"], ["id", 2]]