app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE (released_at <= '2020-05-11 15:58:42.740427') AND (expired_at > '2020-05-11 15:58:42.740427' OR expired_at IS NULL) AND "articles"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
  def show
    articles = Article.all
    articles = articles.open_to_the_public unless current_member

    unless current_member&.administrator?
      articles = articles.visible
    end
    @article = articles.find(params[:id])

SELECT "articles".* FROM "articles" ORDER BY "articles"."released_at" DESC
SELECT  "articles".* FROM "articles" WHERE (released_at <= '2020-05-11 16:12:27.944269') AND (expired_at > '2020-05-11 16:12:27.944269' OR expired_at IS NULL) ORDER BY "articles"."released_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles" WHERE (released_at <= '2020-05-11 16:13:20.279092') AND (expired_at > '2020-05-11 16:13:20.279092' OR expired_at IS NULL)
---
  def index
    @articles = Article.order(released_at: :desc)

    @articles = @articles.open_to_the_public unless current_member

    unless current_member&.administrator?
      @articles = @articles.visible
    end

    @articles = @articles.page(params[:page]).per(5)