app/controllers/entries_controller.rb

SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "entries".* FROM "entries" WHERE (status <> 'draft' OR member_id = 2) ORDER BY "entries"."posted_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "entries" WHERE (status <> 'draft' OR member_id = 2)
---
  def index
    if params[:member_id]
        @member = Member.find(params[:member_id])
        @entries = @member.entries
    else
      @entries = Entry.all
    end

    @entries = @entries.readable_for(current_member)
      .order(posted_at: :desc).page(params[:page]).per(3)

SELECT  "entries".* FROM "entries" WHERE (status <> 'draft' OR member_id = 2) AND "entries"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
---
  def show
    @entry = Entry.readable_for(current_member).find(params[:id])

SELECT  "entries".* FROM "entries" WHERE "entries"."member_id" = ? AND "entries"."id" = ? LIMIT ?  [["member_id", 2], ["id", 20], ["LIMIT", 1]]
---
  def edit
    @entry = current_member.entries.find(params[:id])

INSERT INTO "entries" ("member_id", "title", "body", "posted_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["member_id", 2], ["title", "aa"], ["body", "aa"], ["posted_at", "2020-05-12 06:33:00"], ["created_at", "2020-05-12 06:33:19.549540"], ["updated_at", "2020-05-12 06:33:19.549540"]]
---
  def create
    @entry = Entry.new(entry_params)
    @entry.author = current_member
    if @entry.save

SELECT  "entries".* FROM "entries" WHERE "entries"."member_id" = ? AND "entries"."id" = ? LIMIT ?  [["member_id", 2], ["id", 20], ["LIMIT", 1]]
UPDATE "entries" SET "status" = ?, "updated_at" = ? WHERE "entries"."id" = ?  [["status", "member_only"], ["updated_at", "2020-05-12 06:33:25.371003"], ["id", 31]]
---
  def update
    @entry = current_member.entries.find(params[:id])
    @entry.assign_attributes(entry_params)
    if @entry.save

SELECT  "entries".* FROM "entries" WHERE "entries"."member_id" = ? AND "entries"."id" = ? LIMIT ?  [["member_id", 2], ["id", 20], ["LIMIT", 1]]
DELETE FROM "entries" WHERE "entries"."id" = ?  [["id", 20]]
---
  def destroy
    @entry = current_member.entries.find(params[:id])
    @entry.destroy

SELECT  "entries".* FROM "entries" WHERE (status <> 'draft') AND "entries"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]
INSERT INTO "votes" ("entry_id", "member_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["entry_id", 29], ["member_id", 2], ["created_at", "2020-05-14 06:03:29.430739"], ["updated_at", "2020-05-14 06:03:29.430739"]]
---
  def like
    @entry = Entry.published.find(params[:id])
    current_member.voted_entries << @entry