app/controllers/members_controller.rb

  def index
    @members = Member.order("number").page(params[:page]).per(15)
---
SELECT  "members".* FROM "members" ORDER BY number LIMIT ? OFFSET ?  [["LIMIT", 15], ["OFFSET", 0]]
SELECT COUNT(*) FROM "members"

  def show
    @member = Member.find(params[:id])
---
SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @member = Member.new(member_params)
    if @member.save
---
INSERT INTO "members" ("number", "name", "full_name", "email", "birthday", "administrator", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @member = Member.find(member_params)
    @member.update(params[:member])
---
SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "members" SET "name" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["name", "aaaaa"], ["updated_at", "2020-05-08 13:15:35.106907"], ["id", 11]]

  def destroy
    @member = Member.find(params[:id])
    @member.destroy
---
SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
DELETE FROM "members" WHERE "members"."id" = ?  [["id", 11]]

  def search
    @members = Member.search(params[:q]).page(params[:page]).per(15)
---
SELECT "members".* FROM "members" WHERE (name LIKE '%aa%' or full_name LIKE '%aa%') ORDER BY number