app/controllers/top_controller.rb

SELECT  "articles".* FROM "articles" WHERE (released_at <= '2020-05-11 15:57:44.027576') AND (expired_at > '2020-05-11 15:57:44.027576' OR expired_at IS NULL) ORDER BY "articles"."released_at" DESC LIMIT ?  [["LIMIT", 5]]
---
  def index
    @articles = Article.visible.order(released_at: :desc).limit(5)